src/Catalogs/ЦентральныеСервера/ЦентральныеСервера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦентральныеСервера</name>
  <attributes>
    <name>АдресRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортRAS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЦентральныеСервера/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидХраненияАккаунта) Тогда
		Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ПортRAS) Тогда
		Объект.ПортRAS = 1545;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	ПарольВХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	Пароль = ?(ЗначениеЗаполнено(ПарольВХранилище), УникальныйИдентификатор, "");
	
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПарольИзменен Тогда
		Пароль = СокрЛП(Пароль);
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, СокрЛП(Пароль));
		УстановитьПривилегированныйРежим(Ложь);
		Пароль = ?(ЗначениеЗаполнено(Пароль), УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидХраненияАккаунтаПриИзменении(Элемент)
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	Элементы.Аккаунт.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт);
	Элементы.Логин.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
	Элементы.Пароль.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Перем СтрЛогин, СтрПароль;
	
	Если Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если Не ЗначениеЗаполнено(Объект.Аккаунт) Тогда
			ВызватьИсключение НСтр("ru = 'Не заполнен аккаунт'");		
		КонецЕсли;
		УстановитьПривилегированныйРежим(Истина);
		ПарольВХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Аккаунт);
		УстановитьПривилегированныйРежим(Ложь);
		СтрЛогин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Логин");
		Если ЗначениеЗаполнено(ПарольВХранилище) Тогда
			СтрПароль = ПарольВХранилище;
		Иначе
			СтрПароль = "";
		КонецЕсли;
	ИначеЕсли Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		СтрЛогин = Объект.Логин;
		УстановитьПривилегированныйРежим(Истина);
		ПарольВХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
		Если ЗначениеЗаполнено(ПарольВХранилище) Тогда
			СтрПароль = ПарольВХранилище;
		Иначе
			СтрПароль = "";
		КонецЕсли;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неожиданный вид хранения аккаунта'");
	КонецЕсли;

    Агент = Новый АдминистрированиеСервера(Объект.АдресRAS, Объект.ПортRAS);
    Агент.ВыполнитьАутентификацию(СтрЛогин, СтрПароль);
    Кластеры = Агент.ПолучитьКластеры();
    Для Каждого Кластер Из Кластеры Цикл
        Сообщить(Кластер.Имя);
    КонецЦикла;
КонецПроцедуры
#КонецОбласти
